Revit 2026 API

# HVACLoadTypeHeatingSetPoint Property

---

The heating temperature set point in unit Kelvin (K).

**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double HeatingSetPoint { get; set; }
```
```vb
Public Property HeatingSetPoint As Double
	Get
	Set
```
```cpp
public:
property double HeatingSetPoint {
	double get ();
	void set (double value);
}
```
```fsharp
member HeatingSetPoint : float with get, set
```

#### Property Value

Double

| Exception | Condition |
| --- | --- |
| ArgumentException | When setting this property: |

#### Reference

HVACLoadType Class

Autodesk.Revit.DB.Analysis Namespace